package game

import "image/color"

const (
	tileSize         = 32
	initialMoveDelay = 30
	moveDelay        = 5
	rotateDelay      = 15
)

var easyTetrominoes = [][][]int{
	{
		{1, 1, 1, 1}, // I
	},
	{
		{1, 1, 1},
		{0, 1, 0}, // T
	},
	{
		{1, 1},
		{1, 1}, // O
	},
	{
		{1, 1, 0},
		{0, 1, 1}, // Z
	},
	{
		{0, 1, 1},
		{1, 1, 0}, // S
	},
	{
		{1, 1, 1},
		{1, 0, 0}, // L
	},
	{
		{1, 1, 1},
		{0, 0, 1}, // J
	},
}

var mediumTetrominoes = [][][]int{
	{
		{1, 1, 1, 1},
		{0, 1, 1, 0}, // Расширенный T-блок
	},
	{
		{1, 1, 0},
		{0, 1, 0},
		{0, 1, 1}, // "Г"-образный блок
	},
	{
		{1}, // 1
	},
}

var hardTetrominoes = [][][]int{
	{
		{1, 1, 1},
		{1, 0, 1},
		{1, 1, 1}, // Сложный блок
	},
	{
		{0, 1, 0},
		{1, 1, 1},
		{0, 1, 0}, // Крест
	},
	{
		{1, 0, 0},
		{1, 1, 0},
		{1, 1, 1}, // лесенка
	},
}

var tetrominoColors = []color.RGBA{
	{0, 255, 255, 255},   // I - голубой
	{255, 0, 255, 255},   // T - пурпурный
	{255, 255, 0, 255},   // O - желтый
	{255, 0, 0, 255},     // Z - красный
	{0, 255, 0, 255},     // S - зеленый
	{255, 165, 0, 255},   // L - оранжевый
	{0, 0, 255, 255},     // J - синий
	{128, 128, 128, 255}, // Крест
	{128, 0, 128, 255},   // "Г"-образный блок
	{0, 0, 0, 0},         // невидимый
	{255, 69, 0, 255},    // Сложный блок
	{0, 128, 128, 255},   // Расширенный T-блок
	{73, 92, 122, 255},   // лесенка
}
